// 矩阵相乘
// 描述

// 利用二维数组实现3*4矩阵A与4*5矩阵B乘法，结果存入C矩阵并输出


// 输入
// 4 5 6 8

// 1 2 3 4

// 3 2 5 2


// 2 3 5 7 8

// 4 2 1 6 4

// 2 3 5 8 1

// 2 3 4 7 3


// 输出
// 56 64 87 162 82

// 24 28 38 71 31

// 28 34 50 87 43

#include <stdio.h>

int main() {
    int a[3][4], b[4][5], c[3][5];
    int i, j, k, sum;

    // 输入矩阵A
    for (i = 0; i < 3; i++) {
        for (j = 0; j < 4; j++) {
            scanf("%d", &a[i][j]);
        }
    }

    // 输入矩阵B
    for (i = 0; i < 4; i++) {
        for (j = 0; j < 5; j++) {
            scanf("%d", &b[i][j]);
        }
    }

    // 计算矩阵C
    for (i = 0; i < 3; i++) {
        for (j = 0; j < 5; j++) {
            sum = 0;
            for (k = 0; k < 4; k++) {
                sum += a[i][k] * b[k][j];
            }
            c[i][j] = sum;
        }
    }

    // 打印矩阵C
    for (i = 0; i < 3; i++) {
        for (j = 0; j < 5; j++) {
            printf("%d ", c[i][j]); // 每个数后面都添加一个空格
        }
        printf("\n");
    }

    return 0;
}